NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
    SET_STATE(DFU_STATE_VALIDATE);
}

/*************** Packet handlers ******************/
static void target_rx_start(dfu_packet_t* p_packet, bool* p_do_relay)
{
    bl_info_segment_t* p_segment = NULL;
    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            p_segment = m_bl_info_pointers.p_segment_app;
            break;
        case DFU_TYPE_SD:
            p_segment = m_bl_info_pointers.p_segment_sd;
            break;
        case DFU_TYPE_BOOTLOADER:
            p_segment = m_bl_info_pointers.p_segment_bl;
            break;
        default:
            APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
    }

    m_transaction.p_indicated_start_addr = (uint32_t*) p_packet->payload.start.start_address;
    uint32_t start_address = p_packet->payload.start.start_address;
    /* if the host doesn't know the start address, we use start of segment: */
    if (start_address == START_ADDRESS_UNKNOWN)
    {
        start_address = p_segment->start;
    }
    uint32_t segment_count = segment_count_from_start_packet(p_packet);

    m_transaction.segments_remaining                = segment_count;
    m_transaction.segment_count                     = segment_count;
    m_transaction.p_start_addr                      = (uint32_t*) start_address;
    m_transaction.length                            = p_packet->payload.start.length * 4;
    m_transaction.signature_length                  = p_packet->payload.start.signature_length;
    m_transaction.segment_is_valid_after_transfer   = p_packet->payload.start.last;
    m_transaction.p_last_requested_entry            = NULL;
    m_transaction.signature_bitmap                  = 0;

    /* If no bank was specified, we either have to do it single-banked or find a bank */
    if (m_transaction.p_bank_addr == (uint32_t*) 0xFFFFFFFF)
    {
        if (m_transaction.type == DFU_TYPE_BOOTLOADER)
        {
            __LOG("Placing BL bank at end of application segment.\n");
            uint32_t upper_limit =
                (m_bl_info_pointers.p_segment_app->start) +
                (m_bl_info_pointers.p_segment_app->length);
            if (upper_limit > NRF_UICR->BOOTLOADERADDR)
            {
                upper_limit = NRF_UICR->BOOTLOADERADDR;
            }
            /* Place bootloader bank at end of app section */
            m_transaction.p_bank_addr = (uint32_t*) (upper_limit -
                    (m_transaction.length & ((uint32_t) ~(PAGE_SIZE - 1))) -
                    (PAGE_SIZE));
        }
        else
        {
            /* others will be inline. */
            __LOG("Bank: 0x%x\n", m_transaction.p_start_addr);
            m_transaction.p_bank_addr = m_transaction.p_start_addr;
        }
    }
    else
    {
        if (m_bl_info_pointers.p_segment_app->start +
            m_bl_info_pointers.p_segment_app->length > NRF_UICR->BOOTLOADERADDR)
        {
            send_end_evt(DFU_END_ERROR_BANK_IN_BOOTLOADER_AREA);
            start_find_fwid();
            return;
        }
    }

    __LOG("Set transaction parameters:\n");
    __LOG("\ttype:       %s\n", m_dfu_type_strs[(uint32_t) m_transaction.type]);
    __LOG("\tsegments:   %u\n", segment_count);
    __LOG("\tstart addr: 0x%x\n", start_address);
    __LOG("\tbank addr:  0x%x\n", m_transaction.p_bank_addr);
    __LOG("\tlength:     %u\n", m_transaction.length);
    __LOG("\tsigned:     %s\n", m_transaction.signature_length > 0 ? "YES" : "NO");

    if ((uint32_t) m_transaction.p_start_addr >= p_segment->start &&
            (uint32_t) m_transaction.p_start_addr + m_transaction.length <= p_segment->start + p_segment->length)
    {
        start_target();
        *p_do_relay = true;
    }
    else
    {
        __LOG(RTT_CTRL_TEXT_RED "ERROR: Couldn't make transfer fit inside section.\n");
        tid_cache_entry_put(p_packet->payload.start.transaction_id);
        start_req(m_transaction.type, &m_transaction.target_fwid_union);
    }
}

static uint32_t target_rx_data(dfu_packet_t* p_packet, uint16_t length, bool* p_do_relay)
{
    uint32_t* p_addr = NULL;
    uint32_t error_code = NRF_ERROR_NULL;

    if (p_packet->payload.data.segment <=
            m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH)
    {
        if (m_data_req_segment == p_packet->payload.data.segment)
        {
            m_data_req_segment = 0;
        }
        p_addr = addr_from_seg(p_packet->payload.data.segment, m_transaction.p_start_addr);
        error_code  = dfu_transfer_data((uint32_t) p_addr,
                p_packet->payload.data.data,
                length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));
    }
    else /* treat signature packets at the end */
    {
        uint32_t index = p_packet->payload.data.segment -
            (m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH) - 1;
        if (index >= m_transaction.signature_length / SEGMENT_LENGTH ||
                m_transaction.signature_bitmap & (1 << index))
        {
            error_code = NRF_ERROR_INVALID_STATE;
        }
        else
        {
            memcpy(&m_transaction.signature[index * SEGMENT_LENGTH],
                    p_packet->payload.data.data,
                    length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));

            __LOG("Signature packet #%u\n", index);
            m_transaction.signature_bitmap |= (1 << index);
            error_code = NRF_SUCCESS;
        }
    }

    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    send_progress_event(p_packet->payload.data.segment, m_transaction.segment_count);
    m_transaction.segments_remaining--;
    *p_do_relay = true;
    /* check whether we've lost any entries, and request them */
    uint32_t* p_req_entry = NULL;
    uint32_t req_entry_len = 0;

    if (m_data_req_segment == 0)
    {
        if (dfu_transfer_get_oldest_missing_entry(
                    m_transaction.p_last_requested_entry,
                    &p_req_entry,
                    &req_entry_len) &&
                (
                 /* don't request the previous packet yet */
                 ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr) < p_packet->payload.data.segment - 1 ||
                 m_transaction.segment_count == p_packet->payload.data.segment
                )
           )
        {
            dfu_packet_t req_packet;
            req_packet.packet_type = DFU_PACKET_TYPE_DATA_REQ;
            req_packet.payload.req_data.segment = ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr);
            req_packet.payload.req_data.transaction_id = m_transaction.transaction_id;

