NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
}

static void handle_fwid_packet(dfu_packet_t* p_packet)
{
    if (m_state == DFU_STATE_FIND_FWID)
    {
        /* always upgrade bootloader first */
        if (bootloader_is_newer(p_packet->payload.fwid.bootloader))
        {
            __LOG("\tBootloader upgrade possible\n");
            bl_evt_t fwid_evt;
            fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
            fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_BOOTLOADER;
            fwid_evt.params.dfu.new_fw.fwid.bootloader.id  = p_packet->payload.fwid.bootloader.id;
            fwid_evt.params.dfu.new_fw.fwid.bootloader.ver = p_packet->payload.fwid.bootloader.ver;
            fwid_evt.params.dfu.new_fw.state = m_state;
            bootloader_evt_send(&fwid_evt);
        }
        else if (app_is_newer(&p_packet->payload.fwid.app))
        {
            /* SD shall only be upgraded if a newer version of our app requires a different SD */
            if (p_packet->payload.fwid.sd != 0xFFFE && p_packet->payload.fwid.sd != m_bl_info_pointers.p_fwid->sd)
            {
                __LOG("\tSD upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
                fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_SD;
                fwid_evt.params.dfu.new_fw.fwid.sd = p_packet->payload.fwid.sd;
                fwid_evt.params.dfu.new_fw.state = m_state;
                bootloader_evt_send(&fwid_evt);
            }
            else
            {
                __LOG("\tApp upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
                fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_APP;
                fwid_evt.params.dfu.new_fw.state = m_state;
                memcpy(&fwid_evt.params.dfu.new_fw.fwid.app, &p_packet->payload.fwid.app, sizeof(app_id_t));
                bootloader_evt_send(&fwid_evt);
            }
        }
    }
}

static void handle_data_req_packet(dfu_packet_t* p_packet)
{
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        __LOG("RX data REQ #%u\n", p_packet->payload.data.segment);
        if (m_state == DFU_STATE_RELAY)
        {
            /* only relay new packets, look for it in cache */
            if (!packet_in_cache(p_packet))
            {
                relay_packet(p_packet, 8);
            }
        }
        else
        {
            req_cache_entry_t* p_req_entry = NULL;
            /* check that we haven't served this request recently. */
            for (uint32_t i = 0; i < REQ_CACHE_SIZE; ++i)
            {
                if (m_req_cache[i].segment == p_packet->payload.req_data.segment)
                {
                    if (m_req_cache[i].rx_count++ < REQ_RX_COUNT_RETRY)
                    {
                        return;
                    }
                    p_req_entry = &m_req_cache[i];
                    break;
                }
            }
            /* serve request */
            dfu_packet_t dfu_rsp;
            if (
                dfu_transfer_has_entry(
                    (uint32_t*) SEGMENT_ADDR(p_packet->payload.req_data.segment, m_transaction.p_start_addr),
                    dfu_rsp.payload.rsp_data.data, SEGMENT_LENGTH)
               )
            {
                dfu_rsp.packet_type = DFU_PACKET_TYPE_DATA_RSP;
                dfu_rsp.payload.rsp_data.segment = p_packet->payload.req_data.segment;
                dfu_rsp.payload.rsp_data.transaction_id = p_packet->payload.req_data.transaction_id;

                packet_tx_dynamic(&dfu_rsp, DFU_PACKET_LEN_DATA_RSP, TX_INTERVAL_TYPE_RSP, TX_REPEATS_RSP);
            }

            /* log our attempt at responding */
            if (!p_req_entry)
            {
                p_req_entry = &m_req_cache[(m_req_index++) & (REQ_CACHE_SIZE - 1)];
                p_req_entry->segment = p_packet->payload.req_data.segment;
            }
            p_req_entry->rx_count = 0;
        }
    }
}

static void handle_data_rsp_packet(dfu_packet_t* p_packet, uint16_t length)
{
    if (m_state == DFU_STATE_RELAY)
    {
        /* only relay new packets, look for it in cache */
        if (!packet_in_cache(p_packet))
        {
            send_progress_event(m_transaction.segment_count - m_transaction.segments_remaining + 1,
                    m_transaction.segment_count);
            relay_packet(p_packet, length);
        }
    }
    else
    {
        handle_data_packet(p_packet, length);
    }
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/

void dfu_mesh_init(uint8_t tx_slots)
{
    SET_STATE(DFU_STATE_INITIALIZED);
    m_transaction.transaction_id = 0;
    m_transaction.type = DFU_TYPE_NONE;
    memset(m_req_cache, 0, REQ_CACHE_SIZE * sizeof(m_req_cache[0]));
    m_req_index = 0;
    m_tx_slots = tx_slots;

    get_info_pointers();
}

void dfu_mesh_start(void)
{
    get_info_pointers();
    send_bank_notifications();

    if (!dfu_bank_transfer_in_progress())
    {
        __LOG("DFU mesh start: \n");
        __LOG("\tAPP: %08x.%04x:%08x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->app.company_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_version);
        __LOG("\tSD:  %04x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->sd);
        __LOG("\tBL:  %02x:%02x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.id,
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.ver);

        start_find_fwid();
    }
    else
    {
        __LOG("Bank Transfer in progress!\n");
    }
}

uint32_t dfu_mesh_req(dfu_type_t type, fwid_union_t* p_fwid, uint32_t* p_bank_addr)
{
    if (m_state != DFU_STATE_FIND_FWID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if ((uint32_t) p_bank_addr >= NRF_UICR->BOOTLOADERADDR &&
        (uint32_t) p_bank_addr != 0xFFFFFFFF)
    {
        __LOG("Attempting to overwrite bootloader\n");
        return NRF_ERROR_INVALID_ADDR;
    }

    __LOG("REQUESTING TRANSFER OF %s\n", m_dfu_type_strs[(uint32_t) type]);
    m_transaction.p_bank_addr = p_bank_addr;
    start_req(type, p_fwid);

    return NRF_SUCCESS;
}

uint32_t dfu_mesh_relay(dfu_type_t type, fwid_union_t* p_fwid, uint32_t transaction_id)
{
    if (m_state != DFU_STATE_FIND_FWID &&
        m_state != DFU_STATE_DFU_REQ)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    __LOG("Relay transfer of %s (TID=0x%x)\n", m_dfu_type_strs[type], transaction_id);

    SET_STATE(DFU_STATE_RELAY_CANDIDATE);
    m_transaction.type = type;
    m_transaction.transaction_id = transaction_id;
    fwid_union_cpy(
            &m_transaction.target_fwid_union,
            p_fwid,
            type);
    return NRF_SUCCESS;
}

uint32_t dfu_mesh_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
#ifdef DEBUG_LEDS
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = (1 << 22);
    }
    else
    {
        NRF_GPIO->OUTSET = (1 << 22);
    }
    led = !led;
    NRF_GPIO->OUTSET = (1 << 1);
#endif

    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            handle_data_packet(p_packet, length);
            break;

